let soul=[
    '2018年11月12日 10:12:36  ?深圳的风不比北方的差，吹起来也确实能见到你。',
    '2018年11月19日 20:14:48  ?被风吹的感冒了，但是还是能看到你，哈哈~，请假睡了一天，你是不是也在好好上课呢？有没有皮？这样是会挨揍的，知不知道呀？',
    '2018年11月25日 15:40:08  ?我见众生皆草木，唯独你，是青山！',
    '2018年11月27日 14:38:35  ?人间本不该令我这么欣喜的，但是你来了！你是我的半截的诗，不允许别人更改一个字。',
    '2018年11月28日 16:20:17  ?从亿万人之中，捞出一个来与我相爱，就像从银河里，摘到一颗属于自己的星辰。',
    '2018年11月30日 22:21:58  ?第一次见你的时候，我的心里已经炸成了烟花，需要用一生来打扫灰炉。',
    '2018年12月01日 21:21:58  ?这个世界乱糟糟的，而你干干净净，可以悬在我的心上，作太阳和月亮。',
    '2018年11月12日 10:12:36  ?你风尘仆仆走向我，胜过所有遥远的温柔。',
    '2018年11月19日 20:14:48  ?你别凶了，哄哄我。',
    '2018年11月25日 15:40:08  ?写了五行关于火的诗，两行烧茶，两行留到冬天取暖，剩下的一行，留给你在停电的晚上读我。',
    '2018年11月27日 14:38:35  ?春天温柔了九州山河，而你温柔了春天。',
    '2018年11月28日 16:20:17  ?我想和你一起，经过喧嚣人群，穿越繁华寂寞。清晨，在阳光中醒来。午后读一本书，音乐悠扬，光阴美妙。黄昏的暮色中，等你归来。或有月色，漫步而行，岁月静好。',
    '2019年01月02日 12:10:24  ?一半浮生，两杯清茶，三生有幸，四季有你。',
    '2019年01月02日 13:40:08  ?初见只一回，余生来世都幸会。',
    '2019年01月05日 13:41:26  ?这温吞世俗的人间烟火，只有你是我的江河湖泊。',
    '2019年01月06日 13:42:11  ?世间万千，唯有你是你，是我寻觅一生，携手一辈子的浪漫。',
    '2019年01月06日 13:43:53  ?一生只做两件事，在四季里，温柔地写诗,在岁月里，义无反顾地爱你。',
    '2019年01月07日 14:08:15  ?刚开始，我告诉自己，把每天的生活写成诗，记下来。没想到，后来全写成了你，寄给了你。',
    '2019年01月08日 14:08:15  ?时间如手中的沙，顺隙而落，悄无声息。不知不觉你陪我走过春的迷茫、夏的热烈、秋的呢喃、冬的凛冽。你的温情成为夜色的一部分，我在你温热的眸子里徜徉抑或舞蹈。',
    '2019年01月09日 13:43:53  ?把你的脸迎朝阳光，那就不会有阴影。——柏拉图',
    '2019年01月10日 13:43:53  ?若不快，我可以在夜深人静时，泡一杯飘香的茉莉花茶，捧一本书，点上一盏温暖柔黄的灯，再放上一首或忧伤或舒缓的曲。',
    '2019年02月09日 13:43:53  ?我会披星戴月不辞万里，抛下世俗的一切，奔向你，你身上干净耀眼的少年气，晴朗了我少女时代所有的欢喜。',
    '2019年02月19日 13:43:53  ?你呢？你是天上最美丽的仙女 是七彩的云 飘飘悠悠来到人间 你走过的地方飘着发光的星星 一道阳光随着你照耀向我 使我褪去漫长冬天里的苍白。',
    '2019年02月19日 13:43:53  ?遇到喜欢的人，就像浩劫余生，漂流过沧海，终见陆地。',
    '2019年03月19日 13:43:53  ?念在花田缱绻，情在路上追随，不言不语，微笑相伴左右，浪漫铺满爱的路上，舞一份灵魂的独舞，舞韵翩翩妩媚芬芳，释怀一抹情的暖香，爱在灵魂守候，情在珍惜中永存。',
    '2019年03月19日 13:43:53  ?我喜欢睡前道安。“晚安”是个很缱绻浪漫又温柔的词语，星星点点的困意和所有的美好融在月光里，拌着星屑和你说的晚安一起熬成梦境。我也不晓得睡前说“我爱你”的习惯是什么时候形成的，大概就是想要你熬成的梦境能有我的身影。',
    '2019年03月19日 13:43:53  ?什么是永远？有生之年就是永远。分手不是一定坏事，只是证明那个人不是你的地久天长。在时间线上，是有一个人在等你，时间到了，就会相遇。',
    '2020年03月19日 13:43:53  ?我爱你！因为我昨晚梦见上帝对我说：对十个长得像猪头的人说我爱你。不然会变成猪头，以你的长相当然排在第一位，所以我爱你！',
    '2020年03月19日 13:43:53  ?对你，不管阴晴圆缺，也不变。',
    '2020年03月19日 13:43:53  ?后来才发现那是我眼睛里的光，可那又如何，我爱慕的是你，而非你发着光的模样。',
    '2020年03月19日 13:43:53  ?疲惫的生活需要一个温柔的梦想和一个久违的你。遇见你的那天，樱花开满南山。',
    '2020年03月19日 10:14:04  ?千里姻缘一线牵，爱中缠缠又绵绵，整个人儿把你念，整颗心儿把你盼，不怕山高和水远，爱能永恒永不变，一同蜜蜜又甜甜，想你天天又年年！',
    '2020年03月19日 10:14:04  ?这么多年来，我一直在寻找理想的爱情，但没有一个人能像你那样在最初的时刻打动了我，而且越来越深沉的打动。',
    '2020年03月19日 10:14:04  ?你是自由翱翔的海鸟，我是不起眼的小岛。累了，你可以在我这儿歇歇脚；饿了，可以在我这儿寻找你所需要。其实除了你，我啥都不要！',
    '2020年03月19日 10:14:04  ?牵你的手，朝朝暮暮，牵你的手，等待明天，牵你的手，走过今生，牵你的手，生生世世。',
    '2020年03月19日 10:14:04  ?不知道你今天好不好，我的情况可不妙。只觉得前前后后，左左右右，脑子里里外外，嗡嗡的都是你，你想我吗？',
    '2020年03月19日 10:14:04  ?你这个小妖精，令我中了你的爱情毒却不肯给我解药！小坏蛋！哦！我快要不行了！救救我吧！办法很简单：给我你的爱！',
    '2020年03月19日 10:14:04  ?你的微笑藏在我心里，春风吹我为你动了情，明月照我思念着你，往事历历在梦里，今生注定爱着你，真心真意永不分离。',
    '2020年03月20日 12:07:28  ?亲爱的，我是非常爱你，非常喜欢你的，也许你并不相信我，但是从我见到你的第1面已经深深的为你着迷，见到你的第1面已经无法自拔，现在我每时每刻脑子里想的都是你，你就是我心目当中的五小，我感觉只要能够和你在一起就是非常幸福的，我真的希望能够做你身边的护花使者。',
    '2020年03月19日 10:14:04  ?我要的爱情，一个你，一颗心，一心一意，一辈子。只是这样，再无其他。',
    '2020年03月20日 12:09:34  ?宝贝，谁让我不能，给你足够大的房子，车子，但是我会用我一生尽我所能，给你足够富裕的生活，用我一辈子，来宠你爱你，给你足够的安全感，以后我的所有收入都归你管，以后我们俩的小孩，我来带家务，我来干，你只管歇着就行。'
];
let souls = [
    '2023年03月19日 02:10:24  ? 一半浮生，两杯清茶，三生有幸，四季有你。',
    '2021年05月25日 02:12:54  ? 你昨天晚上又没回我信息，我却看见你的游戏在线，在我再一次孜孜不倦的骚扰你的情况下,你终于跟我说了一句最长的话 “你他妈是不是有病” 我又陷入了沉思，这一定有什么含义,我想了很久你竟然提到了我的妈妈，原来你已经想得那么长远了，想和我结婚见我的父母，我太感动了真的，真的，那你现在在干嘛，我好想你，我妈妈说她也很喜欢你。',
    '2019年12月23日 02:12:45  ? 今天我观战了一天你和别人打游戏，你们玩的很开心，我给你发了200多条消息，你说没流量就不回了，晚上发说说没有人爱你，我连滚带爬评论了句有我在。你把我拉黑了，我给你打电话也无人接听。对不起我不该打扰你。我求求你再给我一次当好友的机会吧！',
    '2020年06月23日 02:12:45  ? 我爸说再敢网恋就打断我的腿，幸好不是胳膊，这样我还能继续和你打字聊天，就算连胳膊也打断了，我的心里也会有你位置。',
    '2017年06月23日 02:12:45  ? 你说你情头是一个人用的，空间上锁是因为你不喜欢玩空间，情侣空间是和闺蜜开的，找你连麦时你说你在忙工作，每次聊天你都说在忙，你真是一个上进的好女孩，你真好，我好喜欢你！',
    '2018年06月23日 02:12:45  ? 你跟他已经醒了吧?我今天捡垃圾挣了一百多明天给你打过去你快点休息吧我明天叫你起床给你点外卖买烟给你点你最喜欢的奶茶晚上我会继续去摆地摊的你不用担心我烦你床只有那么大睡不下三个你要好好照顾好自己不要让他抢你被子我永远爱你',
    '2016年06月23日 02:12:45  ? 你三天没回我的消息在我孜孜不倦地骚扰下你终于舍得回我了你说nmsl我想这一定是有什么含义吧噢!我恍然大悟原来是尼美舒利颗粒他知道我关节炎让我吃尼美舒利颗粒他还是关心我的但是又不想显现的那么热情的天啊他好高冷我好像更喜欢他了?',
    '2020年06月23日 02:12:45  ? 你想我了吧？可以回我消息了吗？我买了万通筋骨贴 你运动一个晚上腰很疼吧？今晚早点回家 我炖了排骨汤，累了一个晚上吧 没事我永远在家等你',
    '2018年12月19日 02:12:45  ? 昨晚你和朋友打了一晚上游戏，你破天荒的给我看了战绩，虽然我看不懂但是我相信你一定是最厉害的，最棒的，我给你发了好多消息夸你，告诉你我多崇拜你，你回了我一句“傻b”，我翻来覆去思考这是什么意思，sh-a傻，噢你是说我傻，那b就是baby的意思了吧，原来你是在叫我傻宝，这么宠溺的语气，我竟一时不敢相信，其实你也是喜欢我的对吧',
    '2018年12月12日 02:13:04  ? 今天我还是照常给你发消息，汇报日常工作，你终于回了我四个字：“嗯嗯，好的”你开始愿意敷衍我了，我太感动了受宠若惊。我愿意天天给你发消息。就算你天天骂我，我也不觉得烦。',
    '2022年06月23日 02:13:17  ? 你昨天晚上又没会我的消息，在我孜孜不倦的骚扰下，你终于舍得回我了，你说“滚”，这其中一定有什么含义，我想了很久，滚是三点水，这代表你对我的思念也如滚滚流水一样汹涌，我感动哭了，不知道你现在在干嘛，我很想你。',
    '2022年06月23日 02:13:17  ? 听说你想要一套化妆品，我算了算，明天我去公司里面扫一天厕所，就可以拿到200块钱，再加上我上个月攒下来的零花钱，刚好给你买一套迪奥。',
    '2022年06月23日 02:13:17  ? 昨晚你和朋友大佬一晚上游戏，你破天荒的给我看了你的战绩，虽然我看不懂但我相信你一定是最厉害的，最棒的！我给你发了好多消息夸你，告诉你我多崇拜你，你回了我一句：啥b，我翻来覆去思考这是什么意思？sh-a傻，噢你的意思是说我傻，那b就是baby的意思了吧，原来你是在叫我傻宝，这么宠溺的语气，我竟一时不相信，其实你也是喜欢我的对吧',
    '2022年06月23日 02:13:17  ? 今天表白被拒绝了，她对我说能不能脱下裤子撒泼尿照照自己，当我脱下裤子，她咽了口水，说我们可以试一下。',
    '2022年06月23日 02:13:17  ? 刚从派出所出来，原因前几天14号情人节，我想送你礼物，我去偷东西的时候被抓了，我本来想反抗，警察说了一句老实点别动，我立刻就放弃了反抗，因为我记得你说过，你喜欢老实人。',
    '2022年06月23日 02:13:17  ? 疫情不能出门，现在是早上八点，你肯定饿了吧。我早起做好了早餐来到你小区。保安大哥不让进。我给你打了三个电话你终于接了有病啊，我还睡觉呢，你小区门口等着吧。啊，我高兴坏了。她终于愿意吃我做的早餐了，她让我等她，啊！啊！啊！',
    '2022年06月23日 02:13:17  ? 我存了两个月钱，给你买了一双北卡蓝，你对我说一句谢谢，我好开心。这是你第一次对我说两个字，以前你都只对我说滚。今天晚上逛咸鱼，看到了你把我送你的北卡蓝发布上去了。我想你一定是在考验我，再次送给你，给你一个惊喜，我爱你。',
    '2022年06月23日 02:13:17  ? 昨天你领完红包就把我删了，我陷入久久地沉思。我想这其中一定有什么含义，原来你是在欲擒故纵，嫌我不够爱你。无理取闹的你变得更加可爱了，我会坚守我对你的爱的。你放心好啦！今天发工资了，发了1850，给你微信转了520，支付宝1314，还剩下16。给你发了很多消息你没回。剩下16块我在小卖部买了你爱吃的老坛酸菜牛肉面，给你寄过去了。希望你保护好食欲，我去上班了爱你~~',
    '2022年06月23日 02:13:17  ? 在保安亭内看完了最新一集的梨泰院，曾经多么倔强的朴世路因为伊瑞给张大熙跪下了，亭外的树也许感受到了我的悲伤，枯了，我连树都保护不了，怎么保护你，或许保安才是真的需要被保护的吧。我难受，我想你。over',
    '2022年06月23日 02:13:17  ? 难以言喻的下午。说不想你是假的，说爱你是真的，昨天他们骂我是你的舔狗，我不相信，因为我知道你肯定也是爱我的，你一定是在考验我对你的感情，只要我坚持下去你一定会被我的真诚所打动，！加油！不过我要批评你一下，昨晚你说去酒店跟人斗地主，我寻思两个人也玩不了呀，算了，不想了，毕竟打牌是赌博行为，不太好。',
    '2022年06月23日 02:13:17  ? 你已经好几分钟没回我信息了，在我孜孜不倦的骚扰下你终于肯回我了 你说滚 这其中一定有什么含义 我想了很久 滚是三点水这代表着你对我的思念也如滚滚流水一样汹涌 我感动哭了 不知道你现在在干嘛 我很想你 ',
    '2022年06月23日 02:13:17  ? 明天就周六了我知道你不上班，但是我怕你睡懒觉不吃早饭饿坏自己，我早晨4点去菜市场买了新鲜活鸡给你炖鸡汤，阿姨给我用箱子装了起来，我骑上我280买的电动车哼着小调回家，心想你一定会被我感动的，箱子半路开了，鸡跑了，拐到了一个胡同里，凌晨4点的胡同还有穿超短裙和大叔聊天的美女，不禁感叹这个世界变了，她问我找什么，…………。对不起，我爱你',
    '2022年06月23日 02:13:17  ? 12点队长过来准时交班，出去的车辆按喇叭我也没听到，只因我在监控中看到了穿睡衣出来倒垃圾的你，望你望的入神不由的傻笑了起来，队长过来骂我扣了我一天工资。我委屈，想抱你。你送的泡面真好吃。',
    '2022年06月23日 02:13:17  ? 今天的我排位输了好多把，我将这些事情分享给您，但是你一个字都没有讲，我在想你是不是在忙？我头痛欲裂，终于在我给你发了几十条消息之后，你终于回了我一个脑子是不是有病？原来你还是关心我的，看到这句话，我的脑子一下就不疼了，今天也是爱你的一天',
    '2022年06月23日 02:13:17  ? 我存了半年的工资，给你买了一只lv，你对我说了一句你真好，我好开心。这是你第一次这么认可我，以前你都只对我说滚。今天晚上逛闲鱼，看到你把我送你的lv发布上去了。我想，你一定是在考验我，于是我用借呗里的钱把它买了下来，再次送给你，给你一个惊喜，我爱你。',
    '2022年06月23日 02:13:17  ? 其实我每月工资6000，但我只给你转2000，你以为我给你了全部。才不是，我一共舔了3个哪，我要舔的雨露均沾，才不会把你当成唯一。',
    '2022年06月23日 02:13:17  ? 昨天你把我拉黑了 我看着红色感叹号陷入了久久的沉思 我想这其中一定有什么含义 红色红色 我明白了 红色代表热情 你对我很热情 你想和我结婚 我愿意',
    '2022年06月23日 02:13:17  ? 今天你问我借了两千块钱，说要做个手术，你果然还是爱我的，不是我的孩子，都不要。 ',
    '2022年06月23日 02:13:17  ? 中午你无故扇了我一巴掌，我握着你的手说“手怎么这么凉，都怪我没有照顾好你，一定要更加对你好”  。',
    '2022年06月23日 02:13:17  ? 我给你打了几通电话，你终于接了。听到了你发出啊啊啊啊的声音，你说你肚子痛，我想你一定是很难受吧。电话还有个男的对你说“来换个姿势”，一定是在做理疗了。期待你早日康复，我好担心。 ',
    '2022年06月23日 02:13:17  ? 昨天晚上也好冷，本来以为街上没人，结果刚刚偷电动车的时候被抓了，本来想反抗，但警察说了一句老实点别动，我立刻就放弃了抵抗，因为我记得你说过，你喜欢老实人。',
    '2022年06月23日 02:13:17  ? 找你连麦时你说你在忙工作，每次聊天你都说在忙，你真是一个上进的好女孩，你真好，发现我越来越喜欢这样优秀的你。',
    '2022年06月23日 02:13:17  ? 你从来没说过爱我，聊天记录搜索了一下“爱”，唯一的一条是：你好像乡村爱情里的刘能啊。',
    '2022年06月23日 02:13:17  ? 今天好开心啊，和你一起在峡谷嬉戏，打完一波团战之后看到你在打大龙，残血的我跳过去直接被龙爪拍死，但这一刻我觉得好浪漫，死在你的脚旁边，这是我离你最近的一次。',
    '2022年06月23日 02:13:17  ? 今天你把我的vx拉黑了，这下我终于解放了！以前我总担心太多消息会打扰你，现在我终于不用顾忌，不管我怎么给你发消息，都不会让你不开心了。等我攒够5201314条我就拿给你看，你一定会震惊得说不出话然后哭着说会爱我一辈子。哈哈。',
    '2022年06月23日 02:13:17  ? 昨天你把我删了，我陷入了久久的沉思 。我想这其中一定有什么含义，你应该是欲擒故纵吧，嫌我不够爱你。突然觉得无理取闹的你变得更加可爱了，我会坚守我对你的爱的 你放心好啦！这么一想，突然对我俩的未来更有期望了呢。',
    '2022年06月23日 02:13:17  ? 今天上班不是太忙，百无聊赖，又翻出了你的相片，看了又看。今天是我认识你的第302天，也是我爱你的第302天，可是这些你并不知道，也许你知道了，也不会在意吧。 此刻的我好想你！ ',
    '2022年06月23日 02:13:17  ? 今天你跟我说我很丑，让我不要骚扰你了。我听了很高兴，小说里的主角都像你这样，最开始表现的很厌恶，但最后总会被我的真心打动。你现在有多讨厌我，以后就会有多爱我。嘻嘻。',
    '2022年06月23日 02:13:17  ? 我坐在窗边给你发了99条消息  你终于肯回我了 你说“发你妈啊”  我一下子就哭了 原来努力真的有用  你已经开始考虑想见我的妈妈了 你也是挺喜欢我的。',
    '2022年06月23日 02:13:17  ? 刚才我找你说话，你回了一个滚，我陷入了沉思，你还是如此的关心我，知道我腿受伤了，让我这样走，好感动！看来你还是爱我的！',
    '2022年06月23日 02:13:17  ? 今天下雨了，我去你公司接你下班。看见我你不耐烦的说：烦不烦啊，不要再找我了。一头冲进雨里就跑开了。我心里真高兴啊，你宁愿自己淋雨，都不愿让我也淋湿一点，你果然还是爱我的。',
    '2022年06月23日 02:13:17  ? 晚上和你聊天，10点钟不到，你就说困了去睡觉了。现在凌晨1点钟，看到你给他的朋友圈点赞评论，约他明天去吃火锅。一定是你微信被盗了吧。',
    '2022年06月23日 02:13:17  ? 今天我主动给你发了游戏邀请，邀请你和我单挑安琪拉，虽然我安琪拉很菜，可是为了和你打游戏，我还是毅然决然给你发了邀请。你说你不接受，你在打其他游戏。联想到我自己很菜，我突然明白，原来你还是在乎我的，只是不想一遍遍连招一套的在泉水送我走。我再一次感动哭了，因此，我好像更喜欢你了，你可真是一个宝藏男孩！',
    '2022年06月23日 02:13:17  ? 你的头像是一个女孩子左手边牵着一条秋田犬,犬=狗,而我是一条舔狗。是不是代表你的小手在牵着我呢?',
    '2022年06月23日 02:13:17  ? 昨天你领完红包就把我删了，我陷入久久地沉思。我想这其中一定有什么含义，原来你是在欲擒故纵，嫌我不够爱你。无理取闹的你变得更加可爱了，我会坚守我对你的爱的。你放心好啦！今天发工资了，发了1850，给你微信转了520，支付宝1314，还剩下16。给你发了很多消息你没回。剩下16块我在小卖部买了你爱吃的老坛酸菜牛肉面，给你寄过去了。希望你保护好食欲，我去上班了爱你~~',
    '2022年06月23日 02:13:17  ? 彩君，今天发工资了，我一个月工资3000，你猜我会给你多少，是不是觉得我会给你2500，自己留500吃饭？你想多了，我3000都给你，因为厂里包吃包住。',
    '2022年06月23日 02:13:17  ? 昨天你把我删了 我看着红色感叹号陷入久久的沉思 我想这其中一定有什么含义 红色红色 我明白了！ 红色代表热情 你对我很热情 你想跟我结婚 我愿意!!! ',
    '2022年06月23日 02:13:17  ? 昨天就为你充了710点卷，虽然知道你不会玩不知去向，但你说好看，你刚才说小号想要还想要一个，爱你的我还是满心欢喜的把剩下的100元伙食费又给你充了710，然后看到你小号并没有买，而是你送给了你的一个弟弟，你对弟弟真好，好有爱心，我感觉对你陷得很深了。',
    '2022年06月23日 02:13:17  ? 今天我给你发消息，你回复我nmsl，我想了半天才知道你是在夸我，原来是你美死了，你嘴真甜，我爱你。',
    '2022年06月23日 02:13:17  ? 抢银行的时候被抓了，我本来想反抗，警察说了一句老实点别动。我立刻就放弃了抵抗。因为我记得你说过你喜欢老实人。',
    '2023年03月20日 04:22:24  ? 冲冠一怒为红颜，红颜大多为祸水。。。'
];

// let date = [[2021年5月31日][sdfdf],[454121][55656],[][],[][],[][],[][],[][],];

function randomSentence() {
  let a=soul[Math.floor(Math.random() * soul.length)];
  //document.getElementById('sentence').innerHTML = soul[Math.floor(Math.random() * soul.length)];
    let data=a.split('?');
    document.getElementById('ymds').innerHTML = data[0].valueOf();
    document.getElementById('sentence').innerHTML = data[1].valueOf();


    // document.getElementById("timecalculation").innerHTML=y+"年"+m+"月"+d+"日";
}

function randomSentences() {
    let a=souls[Math.floor(Math.random() * souls.length)];
    //document.getElementById('sentence').innerHTML = soul[Math.floor(Math.random() * soul.length)];
    let data=a.split('?');
    document.getElementById('ymds').innerHTML = data[0].valueOf();
    document.getElementById('sentence').innerHTML = data[1].valueOf();


    // document.getElementById("timecalculation").innerHTML=y+"年"+m+"月"+d+"日";
}

function timeint()
{
    var new_date = new Date(); //新建一个日期对象，默认现在的时间
    var old_date = new Date("2018-11-12 22:22:02"); //设置过去的一个时间点，"yyyy-MM-dd HH:mm:ss"格式化日期
    var difftime = (new_date - old_date)/1000; //计算时间差,并把毫秒转换成秒
    var days = parseInt(difftime/86400); // 天  24*60*60*1000
    var hours = parseInt(difftime/3600)-24*days;    // 小时 60*60 总小时数-过去的小时数=现在的小时数
    var minutes = parseInt(difftime%3600/60); // 分钟 -(day*24) 以60秒为一整份 取余 剩下秒数 秒数/60 就是分钟数
    var seconds = parseInt(difftime%60);  // 以60秒为一整份 取余 剩下秒数
    document.getElementById("timecalculation").innerHTML=days+"天, "+add0(hours)+"小时, "+add0(minutes)+"分钟, "+add0(seconds)+"秒"

    var year = new_date.getFullYear();
    var month = new_date.getMonth() + 1;
    var day = new_date.getDate();
    var h = new_date.getHours();
    var m = new_date.getMinutes();
    var s = new_date.getSeconds();

    document.getElementById("ymd").innerHTML=(year + '年' + add0(month) + '月' + add0(day) + '日' + add0(h) + ':' + add0(m) + ':' + add0(s));

}
function add0(m){
    return m<10?'0'+m:m
}
// randomSentences();
randomSentence();
setInterval(timeint, 0);
// randomSentence();
